= はじめに

//flushright{

2024年5月
mochikoAsTech

//}

この本を手に取ってくださったあなた、こんにちは、あるいははじめまして。『生成AIと一緒に「分かりやすい文章を書く」ためのテクニカルライティング（仮題）』の筆者、mochikoAsTechです。

ちょっと頼めば生成AIが短時間で何百枚でも原稿を書いてくれるのに、技術ブログや技術書を今さら「手で書く」必要はあるのか。作るときの「苦労」の量ではなく、できあがったものの内容を評価すべきと分かっていても「AI臭」の抜けない登壇資料だとまともに読む気がしなくなってしまうのはなぜなのか。

そういうテクニカルライティングとAIについて、最近ずっと考えていることを書いていきます。

本書が「生成AIを使ってもっと文章がうまく書けるようになったらいいな」と思っている方の一助となれれば嬉しく思います。

== 想定する読者層

本書は、こんな人に向けて書かれています。

 * 文章がうまく書けるようになりたい人
 * テキストでのコミュニケーションで誤解されることが多くて困っている人
 * 相手の理解度にあわせた説明ができるようになりたい人
 * 技術書や技術記事を書いている人
 * 技術書の翻訳をしている人
 * 英語ができないけど英語でドキュメントを書いている人
 * ちゃんとドキュメントを残したい人
 * ごちゃついた情報をスッキリ整理したい人

== マッチしない読者層

本書は、こんな人が読むと恐らく「not for meだった…（私向けじゃなかった）」となります。

 * 魅力的な小説や詩文を書けるようになりたい人
 * 広告やキャッチコピーが書けるようになりたい人
 * 法務文書を書くときのコツが知りたい人

//pagebreak

== 本書のゴール

本書を読み終わると、あなたはこのような状態になっています。

 * 読む前よりも実用文がうまく書ける
 * テキストコミュニケーションで相手の誤解を生まなくなる
 * 悩みすぎて筆が進まない状態から早めに脱出できる
 * レビュイーが受け止めやすい形で文章のレビューができる
 * 英語ができないのに英語を書かなければいけないときになんとか頑張れる

== 免責事項

本書に記載された社名、製品名およびサービス名は、各社の登録商標または商標です。

本書に記載されている内容は筆者の所属する組織の公式見解ではありません。

また本書はできるだけ正確を期すように努めましたが、筆者が内容を保証するものではありません。よって本書の記載内容に基づいて読者が行なった行為、及び読者が被った損害について筆者は何ら責任を負うものではありません。

不正確あるいは誤認と思われる箇所がありましたら、必要に応じて適宜改訂を行ないますのでGitHubのIssueやPull Requestで筆者までお知らせいただけますと幸いです。

@<href>{https://github.com/mochikoAsTech/technical-writing-with-ai}
