= はじめに

//flushright{

2024年5月
mochikoAsTech

//}

この本を手に取ってくださったあなた、こんにちは、あるいははじめまして。『生成AI時代に自分で「分かりやすい文章を書く」ためのテクニカルライティング（仮題）』の筆者、mochikoAsTechです。

筆者は2026年に、「Bookathon」という3日間で技術書を書き上げるハッカソンイベントを2回開催しました。体感として、技術記事や技術書を書いてみたいと思っている若手エンジニアは多いものの、でも「自分の技術力で本が書けるのか」あるいは「何について書けるのかも分からない」、そして「編集者のツテやきっかけもないのでやりたいけど一歩を踏み出せない」と思っている若手が多かったため、その背中を押すような場が必要だと感じていたからです。

ですが、生成AIの精度が上がってくるにつれて、純粋に「書きたいけどどうしたら？」という相談よりも、「ちょっと頼めば生成AIが短時間で何百枚でも原稿を書いてくれるのに、技術ブログや技術書を今さら僕が『手で書く』意味ってあるんでしょうか？」という不安そうな質問の方が増えてきました。

筆者は、「分かりやすい技術書」が生まれるときに最も益を得るのは、実は「読んで学ぶ」読者ではなく、執筆を通して知識不足に気づいて、調べたり学んだりする著者自身だと思っています。


だから、若手をはじめ、書いてみたいと思っている人には「本を書く機会」を得てほしい。

作るときの「苦労」の量ではなく、できあがったものの内容を評価すべきと分かっていても「AI臭」の抜けない登壇資料だとまともに読む気がしなくなってしまうのはなぜなのか。

そういうテクニカルライティングとAIについて、最近ずっと考えていることを書いていきます。

本書が「生成AIを使ってもっと文章がうまく書けるようになったらいいな」と思っている方の一助となれれば嬉しく思います。

== 想定する読者層

本書は、こんな人に向けて書かれています。

 * まだ本を書いたことがない人
 * いつかは技術記事や技術書を書いてみたいと思っている人
 * 技術書典に出てみたいと思っている人
 * 技術力のあるエンジニアになりたい人
 * 今まで技術ブログや技術記事、技術書を書いてきた人
 * AIが速く大量に書ける時代に、自分が手で書く意味なんてあるのかと疑問に思っている人

== マッチしない読者層

本書は、こんな人が読むと恐らく「not for meだった…（私向けじゃなかった）」となります。

 * 魅力的な小説や詩文を書けるようになりたい人
 * 広告やキャッチコピーが書けるようになりたい人
 * 法務文書を書くときのコツが知りたい人

//pagebreak

== 本書のゴール

本書を読み終わると、あなたはこのような状態になっています。

 * 読む前よりも実用文がうまく書ける
 * テキストコミュニケーションで相手の誤解を生まなくなる
 * 悩みすぎて筆が進まない状態から早めに脱出できる
 * レビュイーが受け止めやすい形で文章のレビューができる
 * 英語ができないのに英語を書かなければいけないときになんとか頑張れる

== 免責事項

本書に記載された社名、製品名およびサービス名は、各社の登録商標または商標です。

本書に記載されている内容は筆者の所属する組織の公式見解ではありません。

また本書はできるだけ正確を期すように努めましたが、筆者が内容を保証するものではありません。よって本書の記載内容に基づいて読者が行なった行為、及び読者が被った損害について筆者は何ら責任を負うものではありません。

不正確あるいは誤認と思われる箇所がありましたら、必要に応じて適宜改訂を行ないますのでGitHubのIssueやPull Requestで筆者までお知らせいただけますと幸いです。

@<href>{https://github.com/mochikoAsTech/technical-writing-with-ai}
